<a href="https://colab.research.google.com/github/JD950/Python_notebook/blob/main/TextAnalysisRegex_13.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# Exploratory Text Analysis

## What kinds of text analysis are there?

* analyst knows the pattern
    * regular expressions
* analyst does not know the pattern
    * natural language processing
        * compares historical examples to judge novel cases
            * comparisons are statistical and approximate

### Examples of Analysis

In [ ]:
pattern = '£ ?[0-9][0-9]?' # £ then SPACE-optional then digit then digit-optional 

document = 'Eggs cost £3, bread cost £2, organic apple juice cost £5'

In [ ]:
import re

In [ ]:
re.findall(pattern, document)

['£3', '£2', '£5']

If you dont:

* sentiment analysis
    * how positive/negative is this (new) review?
* topic analysis 
    * what is this document about?

## What can I do if I know what pattern I want to find?

* finding ("extracting")
    * what matches the pattern?
* matching ("validating")
    * does the entire document match YES/NO?
* substitue ("replacing")
    * replace a part that matches a pattern with another...

## How do I validate text with pandas?

In [ ]:
import pandas as pd

In [ ]:
ti = pd.read_csv('datasets/titanic.csv')
ti.sample(1)

     survived  pclass   sex   age  ...  deck  embark_town  alive alone
607         1       1  male  27.0  ...   NaN  Southampton    yes  True

[1 rows x 15 columns]

In [ ]:
ti['ticket'] = "Ticket: " + ti['class'] + "; Price: $ " + ti['fare'].astype(str) + "; Port: " + ti['embark_town'] + ";"

In [ ]:
ti[['class', 'fare', 'embark_town', 'ticket']].head(3)

   class  ...                                             ticket
0  Third  ...   Ticket: Third; Price: $ 7.25; Port: Southampton;
1  First  ...  Ticket: First; Price: $ 71.2833; Port: Cherbourg;
2  Third  ...  Ticket: Third; Price: $ 7.925; Port: Southampton;

[3 rows x 4 columns]

In [ ]:
pattern = '(First|Second)'

ti['class'].str.match(pattern)

0      False
1       True
2      False
3       True
4      False
       ...
886     True
887     True
888    False
889     True
890    False
Name: class, Length: 891, dtype: bool

In [ ]:
ti.loc[ ti['class'].str.match(pattern)  , 'survived'].mean()

0.5575

## How do I extract data with pandas?

In [ ]:
ti[['class', 'fare', 'embark_town', 'ticket']].head(3)

   class  ...                                             ticket
0  Third  ...   Ticket: Third; Price: $ 7.25; Port: Southampton;
1  First  ...  Ticket: First; Price: $ 71.2833; Port: Cherbourg;
2  Third  ...  Ticket: Third; Price: $ 7.925; Port: Southampton;

[3 rows x 4 columns]

In [ ]:
pattern = '([0-9.]+)'

ti['ticket'].str.extract(pattern).sample(4)

            0
669      52.0
747      13.0
118  247.5208
352    7.2292

## How do I substitue text with pandas?

In [ ]:
ti['ticket'].str.replace('$', '€').sample(1)

262    Ticket: First; Price: € 79.65; Port: Southampton;
Name: ticket, dtype: object

## What are regular expressions?

In [ ]:
ti['ticket'].str.extract('(Ticket: (First|Second))')

                  0       1
0               NaN     NaN
1     Ticket: First   First
2               NaN     NaN
3     Ticket: First   First
4               NaN     NaN
..              ...     ...
886  Ticket: Second  Second
887   Ticket: First   First
888             NaN     NaN
889   Ticket: First   First
890             NaN     NaN

[891 rows x 2 columns]

In [ ]:
ti['ticket'].str.extract('( [0-9][0-9])')

       0
0    NaN
1     71
2    NaN
3     53
4    NaN
..   ...
886   13
887   30
888   23
889   30
890  NaN

[891 rows x 1 columns]

In [ ]:
ti['ticket'].sample(1)

460    Ticket: First; Price: $ 26.55; Port: Southampton;
Name: ticket, dtype: object

In [ ]:
ti['ticket'].str.extract('(Ticket: [A-Z])').sample(2)

             0
358  Ticket: T
453  Ticket: F

In [ ]:
ti['ticket'].str.extract('(T........)').sample(3)

             0
636  Ticket: T
774  Ticket: S
40   Ticket: T

In [ ]:
ti['ticket'].str.extract('(Price: [^0-9A-Za-z] ..)').sample(3)

               0
134  Price: $ 13
825  Price: $ 6.
246  Price: $ 7.

In [ ]:
ti['ticket'].str.extract('(Port: (Cherbourg|Southampton))').sample(3)

                     0            1
125    Port: Cherbourg    Cherbourg
91   Port: Southampton  Southampton
426  Port: Southampton  Southampton

* repetitions
    * optional `?`
        * an optional number: `[0-9]?`
    * one or more `+`
        * one or more spaces: ` +`  
    * optional, or more, `*`
        * ` [0-9][0-9]?.[0-9]*`

In [ ]:
ti['ticket'].str.extract('([0-9][0-9]?.[0-9]*)').sample(3)

        0
149  13.0
166  55.0
527   221

In [ ]:
ti['ticket'].str.extract('(Ticket: [a-zA-Z]+)').sample(3)

                  0
450  Ticket: Second
783   Ticket: Third
9    Ticket: Second

In [ ]:
row = 0
match = 1 # second match

ti['ticket'].str.extractall('([a-zA-Z]+: [a-zA-Z]+)').loc[row, match]

0    Port: Southampton
Name: (0, 1), dtype: object

In [ ]:
ti['ticket'].str.extract('([a-zA-Z]+tow?n)')

               0
0    Southampton
1            NaN
2    Southampton
3    Southampton
4    Southampton
..           ...
886  Southampton
887  Southampton
888  Southampton
889          NaN
890   Queenstown

[891 rows x 1 columns]

* EXTRA: 
    * escaping
        * How do I say, literally, the `.` symbol?
        * `\.`

In [ ]:
ti['ticket'].str.extract('(\$ [0-9]+\.[0-9]+)').sample(2)

          0
339  $ 35.5
732   $ 0.0

* positional matching
    * `^` means **at the beginning**
    * `$` means **at the end**

In [ ]:
ti['ticket'].str.extractall('([a-zA-Z]+: [a-zA-Z]+;$)').sample(1)

                            0
    match
127 0      Port: Southampton;

In [ ]:
ti['ticket'].str.extractall('(^[a-zA-Z]+: [a-zA-Z]+;)').sample(1)

                        0
    match
645 0      Ticket: First;

In [ ]:
ti['ticket'].str.findall('([a-zA-Z]+[ :])').sample(10)

83     [Ticket:, Price:, Port:]
741    [Ticket:, Price:, Port:]
396    [Ticket:, Price:, Port:]
687    [Ticket:, Price:, Port:]
808    [Ticket:, Price:, Port:]
409    [Ticket:, Price:, Port:]
174    [Ticket:, Price:, Port:]
350    [Ticket:, Price:, Port:]
118    [Ticket:, Price:, Port:]
778    [Ticket:, Price:, Port:]
Name: ticket, dtype: object

In [ ]:
ti['ticket'].str.extract('(\$ [0-9]+\.[0-9]+)').sample(2)

           0
4     $ 8.05
719  $ 7.775

In [ ]:
row = 0
match = 1 # second match
ti['ticket'].str.extractall('(\$ [0-9][0-9][0-9]+\.[0-9]+)')#.loc[row, 0]